In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.675496 -0.165510 -0.346869  0.422199
B  0.721067  0.135342  1.054207  1.124483
C -0.121607 -0.668466 -0.773945 -0.030657
D -0.314309 -1.409972  2.657446  0.203114
E  1.833136 -1.207776 -1.211528 -0.548641

In [3]:
df['W']

A    0.675496
B    0.721067
C   -0.121607
D   -0.314309
E    1.833136
Name: W, dtype: float64

In [4]:
# pass a list of column names
df[['W','Z']]

          W         Z
A  0.675496  0.422199
B  0.721067  1.124483
C -0.121607 -0.030657
D -0.314309  0.203114
E  1.833136 -0.548641

In [5]:
type(df['W'])

pandas.core.series.Series

In [6]:
# **Creating a new column:**

df['new']=df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.675496 -0.165510 -0.346869  0.422199  0.328627
B  0.721067  0.135342  1.054207  1.124483  1.775274
C -0.121607 -0.668466 -0.773945 -0.030657 -0.895552
D -0.314309 -1.409972  2.657446  0.203114  2.343137
E  1.833136 -1.207776 -1.211528 -0.548641  0.621608

In [7]:
# **Removing Columns**

df.drop('new',axis=1)

          W         X         Y         Z
A  0.675496 -0.165510 -0.346869  0.422199
B  0.721067  0.135342  1.054207  1.124483
C -0.121607 -0.668466 -0.773945 -0.030657
D -0.314309 -1.409972  2.657446  0.203114
E  1.833136 -1.207776 -1.211528 -0.548641

In [8]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A  0.675496 -0.165510 -0.346869  0.422199  0.328627
B  0.721067  0.135342  1.054207  1.124483  1.775274
C -0.121607 -0.668466 -0.773945 -0.030657 -0.895552
D -0.314309 -1.409972  2.657446  0.203114  2.343137

In [9]:
# **Selecting Rows**
 
df.loc['A']

W      0.675496
X     -0.165510
Y     -0.346869
Z      0.422199
new    0.328627
Name: A, dtype: float64

In [10]:
# or select based off of position instead of label

df.iloc[2]

W     -0.121607
X     -0.668466
Y     -0.773945
Z     -0.030657
new   -0.895552
Name: C, dtype: float64

In [11]:
# **Selecting subset of rows and columns**
df.loc['B','Y']

1.0542065275279104

In [12]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.675496 -0.346869
B  0.721067  1.054207

In [13]:
# ### Conditional Selection
# 
# An important feature of pandas is conditional selection using bracketnotation,very similiar to numpy:

df

          W         X         Y         Z       new
A  0.675496 -0.165510 -0.346869  0.422199  0.328627
B  0.721067  0.135342  1.054207  1.124483  1.775274
C -0.121607 -0.668466 -0.773945 -0.030657 -0.895552
D -0.314309 -1.409972  2.657446  0.203114  2.343137
E  1.833136 -1.207776 -1.211528 -0.548641  0.621608

In [14]:
df>0

       W      X      Y      Z    new
A   True  False  False   True   True
B   True   True   True   True   True
C  False  False  False  False  False
D  False  False   True   True   True
E   True  False  False  False   True

In [15]:
df[df>0]

          W         X         Y         Z       new
A  0.675496       NaN       NaN  0.422199  0.328627
B  0.721067  0.135342  1.054207  1.124483  1.775274
C       NaN       NaN       NaN       NaN       NaN
D       NaN       NaN  2.657446  0.203114  2.343137
E  1.833136       NaN       NaN       NaN  0.621608

In [16]:
df[df['W']>2]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [17]:
df[df['W']>0]['Y']

A   -0.346869
B    1.054207
E   -1.211528
Name: Y, dtype: float64

In [18]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.346869 -0.165510
B  1.054207  0.135342
E -1.211528 -1.207776

In [19]:
# for two conditions you can use | and & with paranthesis:


df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z       new
B  0.721067  0.135342  1.054207  1.124483  1.775274

In [20]:
df

          W         X         Y         Z       new
A  0.675496 -0.165510 -0.346869  0.422199  0.328627
B  0.721067  0.135342  1.054207  1.124483  1.775274
C -0.121607 -0.668466 -0.773945 -0.030657 -0.895552
D -0.314309 -1.409972  2.657446  0.203114  2.343137
E  1.833136 -1.207776 -1.211528 -0.548641  0.621608

In [21]:
# reset to default 0,1...n index

df.reset_index()

  index         W         X         Y         Z       new
0     A  0.675496 -0.165510 -0.346869  0.422199  0.328627
1     B  0.721067  0.135342  1.054207  1.124483  1.775274
2     C -0.121607 -0.668466 -0.773945 -0.030657 -0.895552
3     D -0.314309 -1.409972  2.657446  0.203114  2.343137
4     E  1.833136 -1.207776 -1.211528 -0.548641  0.621608

In [22]:
newind='CA NY WY OR CO'.split()

df['States']=newind
df

          W         X         Y         Z       new States
A  0.675496 -0.165510 -0.346869  0.422199  0.328627     CA
B  0.721067  0.135342  1.054207  1.124483  1.775274     NY
C -0.121607 -0.668466 -0.773945 -0.030657 -0.895552     WY
D -0.314309 -1.409972  2.657446  0.203114  2.343137     OR
E  1.833136 -1.207776 -1.211528 -0.548641  0.621608     CO

In [23]:
df.set_index('States',inplace=True)
df

               W         X         Y         Z       new
States
CA      0.675496 -0.165510 -0.346869  0.422199  0.328627
NY      0.721067  0.135342  1.054207  1.124483  1.775274
WY     -0.121607 -0.668466 -0.773945 -0.030657 -0.895552
OR     -0.314309 -1.409972  2.657446  0.203114  2.343137
CO      1.833136 -1.207776 -1.211528 -0.548641  0.621608

In [24]:
# ## Multi-Index and Index Hierarchy

# index Levels

outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [25]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [26]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.373787  2.164641
   2  0.812546 -1.223063
   3  0.442197 -0.226119
G2 1 -0.970312 -0.025546
   2 -1.559125 -0.055662
   3 -0.968820 -1.721182

In [27]:
df.loc['G1']

          A         B
1  0.373787  2.164641
2  0.812546 -1.223063
3  0.442197 -0.226119

In [28]:
df.loc['G1'].loc[1]

A    0.373787
B    2.164641
Name: 1, dtype: float64

In [29]:
df.index.names

FrozenList([None, None])

In [30]:
df.index.names=['Group','Num']
df

                  A         B
Group Num
G1    1    0.373787  2.164641
      2    0.812546 -1.223063
      3    0.442197 -0.226119
G2    1   -0.970312 -0.025546
      2   -1.559125 -0.055662
      3   -0.968820 -1.721182

In [31]:
# xs function returns the specified portion from the dataframe
#here the function return the value from the index 'G1'

df.xs('G1')

            A         B
Num
1    0.373787  2.164641
2    0.812546 -1.223063
3    0.442197 -0.226119

In [32]:
df.xs(['G1',1])

C:\Users\jasee\AppData\Local\Temp\ipykernel_9320\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    0.373787
B    2.164641
Name: (G1, 1), dtype: float64

In [33]:
df.xs(1,level='Num')

              A         B
Group
G1     0.373787  2.164641
G2    -0.970312 -0.025546

In [34]:
# ### Creating a Series
# You can convert a list,numpy array,or dictionary to a series:

labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [35]:
# **Using Lists**

pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [36]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [37]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [38]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [39]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [40]:
# *** Dictionary**
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [41]:
# ## data in a Series
#
# A panda Series can hold a variety of object types:

pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [42]:
# ## Using an Index

ser1=pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [43]:
ser2=pd.Series([1,2,5,4],index=['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [44]:
ser1['USA']

1

In [45]:
# Operations are then also based off of index:

ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [46]:
# Missing data

df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
                'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [48]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [49]:
# thresh takes integer value whivh tells minimum amount of na values to drop

df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [50]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [51]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [52]:
# GROUP BY
# Create dataframe

data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [53]:
df.groupby('Company')

In [54]:
# you can save this object as a new variable:
by_comp=df.groupby("Company")

In [55]:
by_comp

In [56]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [57]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [58]:
# More examples of aggregate methods:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [59]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [60]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [61]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [62]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [63]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [64]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [65]:
# Operations
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [66]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [67]:
# pandas nunique is used to get a count of unique values
df['col2'].nunique()

3

In [68]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [69]:
# Select from DataFrame using criteria from multiple columns

newdf=df[(df['col1']>2)&(df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [70]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [71]:
df['col1'].sum()

10

In [72]:
# **Permanently Removing a column**

del df['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [73]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [74]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [75]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [76]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [77]:
# ** Find Null Values or Check for Null Values**
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [78]:
# Drop rows with Nan Values

df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [79]:
df=pd.DataFrame({'col1':[1,2,3,np.nan],
                'col2':[np.nan,555,666,444],
                'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [80]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [81]:
data={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}
df=pd.DataFrame(data)

In [82]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1